project05/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
	@articles = Article.paginate page: params[:page], order: 'created_at desc', per_page: 10

INSERT INTO "articles" ("author", "author_id", "body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "body" = '	This article about articles is probably the sweetest article you''ll ever read.
---
  def update
    @article = Article.find(params[:id])

    if @article.update_attributes(params[:article])