project05/app/views/articles/_form.html.haml

SELECT "authors".* FROM "authors"
---
    %br/
    = f.select :author_id, Author.all.collect {|t| [t.name, t.id]}, {:prompt => 'Please select a author for your article'}
  .field