project05/app/views/articles/index.html.haml

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
      %td{:colspan => "6"}
        %p= pluralize(@articles.size, 'article')